results/rest/stage-50/payload-heavy/800VUs/repeat-2/800vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-50/payload-heavy/800VUs/repeat-2/800vus.json)

     scenarios: (100.00%) 1 scenario, 800 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 800 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 800/800 VUs, 87 complete and 0 interrupted iterations
default   [   2% ] 800 VUs  0m01.0s/1m0s

running (0m02.0s), 800/800 VUs, 651 complete and 0 interrupted iterations
default   [   3% ] 800 VUs  0m02.0s/1m0s

running (0m02.9s), 800/800 VUs, 1232 complete and 0 interrupted iterations
default   [   5% ] 800 VUs  0m02.9s/1m0s

running (0m04.0s), 800/800 VUs, 1784 complete and 0 interrupted iterations
default   [   7% ] 800 VUs  0m04.0s/1m0s

running (0m05.0s), 800/800 VUs, 2359 complete and 0 interrupted iterations
default   [   8% ] 800 VUs  0m05.0s/1m0s

running (0m06.0s), 800/800 VUs, 2928 complete and 0 interrupted iterations
default   [  10% ] 800 VUs  0m06.0s/1m0s

running (0m07.0s), 800/800 VUs, 3475 complete and 0 interrupted iterations
default   [  12% ] 800 VUs  0m07.0s/1m0s

running (0m08.0s), 800/800 VUs, 4058 complete and 0 interrupted iterations
default   [  13% ] 800 VUs  0m08.0s/1m0s

running (0m08.1s), 800/800 VUs, 4626 complete and 0 interrupted iterations
default   [  15% ] 800 VUs  0m09.0s/1m0s

running (0m09.1s), 800/800 VUs, 5201 complete and 0 interrupted iterations
default   [  17% ] 800 VUs  0m10.0s/1m0s

running (0m10.1s), 800/800 VUs, 5814 complete and 0 interrupted iterations
default   [  18% ] 800 VUs  0m11.0s/1m0s

running (0m11.1s), 800/800 VUs, 6394 complete and 0 interrupted iterations
default   [  20% ] 800 VUs  0m12.0s/1m0s

running (0m12.1s), 800/800 VUs, 6924 complete and 0 interrupted iterations
default   [  22% ] 800 VUs  0m13.0s/1m0s

running (0m13.1s), 800/800 VUs, 7570 complete and 0 interrupted iterations
default   [  23% ] 800 VUs  0m14.0s/1m0s

running (0m14.1s), 800/800 VUs, 8101 complete and 0 interrupted iterations
default   [  25% ] 800 VUs  0m15.0s/1m0s

running (0m15.1s), 800/800 VUs, 8735 complete and 0 interrupted iterations
default   [  27% ] 800 VUs  0m16.0s/1m0s

running (0m16.1s), 800/800 VUs, 9240 complete and 0 interrupted iterations
default   [  28% ] 800 VUs  0m17.0s/1m0s

running (0m17.1s), 800/800 VUs, 9792 complete and 0 interrupted iterations
default   [  30% ] 800 VUs  0m18.0s/1m0s

running (0m18.1s), 800/800 VUs, 10370 complete and 0 interrupted iterations
default   [  32% ] 800 VUs  0m19.0s/1m0s

running (0m19.1s), 800/800 VUs, 10959 complete and 0 interrupted iterations
default   [  33% ] 800 VUs  0m20.0s/1m0s

running (0m20.1s), 800/800 VUs, 11488 complete and 0 interrupted iterations
default   [  35% ] 800 VUs  0m21.0s/1m0s

running (0m21.1s), 800/800 VUs, 12031 complete and 0 interrupted iterations
default   [  37% ] 800 VUs  0m22.0s/1m0s

running (0m22.1s), 800/800 VUs, 12595 complete and 0 interrupted iterations
default   [  38% ] 800 VUs  0m23.0s/1m0s

running (0m23.1s), 800/800 VUs, 13179 complete and 0 interrupted iterations
default   [  40% ] 800 VUs  0m24.0s/1m0s

running (0m24.1s), 800/800 VUs, 13769 complete and 0 interrupted iterations
default   [  42% ] 800 VUs  0m25.0s/1m0s

running (0m25.1s), 800/800 VUs, 14365 complete and 0 interrupted iterations
default   [  43% ] 800 VUs  0m26.0s/1m0s

running (0m26.1s), 800/800 VUs, 14923 complete and 0 interrupted iterations
default   [  45% ] 800 VUs  0m27.0s/1m0s

running (0m27.1s), 800/800 VUs, 15508 complete and 0 interrupted iterations
default   [  47% ] 800 VUs  0m28.0s/1m0s

running (0m28.1s), 800/800 VUs, 16076 complete and 0 interrupted iterations
default   [  48% ] 800 VUs  0m29.0s/1m0s

running (0m29.1s), 800/800 VUs, 16638 complete and 0 interrupted iterations
default   [  50% ] 800 VUs  0m30.0s/1m0s

running (0m30.1s), 800/800 VUs, 17215 complete and 0 interrupted iterations
default   [  52% ] 800 VUs  0m31.0s/1m0s

running (0m31.1s), 800/800 VUs, 17764 complete and 0 interrupted iterations
default   [  53% ] 800 VUs  0m32.0s/1m0s

running (0m32.1s), 800/800 VUs, 18298 complete and 0 interrupted iterations
default   [  55% ] 800 VUs  0m33.0s/1m0s

running (0m33.1s), 800/800 VUs, 18843 complete and 0 interrupted iterations
default   [  57% ] 800 VUs  0m34.0s/1m0s

running (0m34.1s), 800/800 VUs, 19381 complete and 0 interrupted iterations
default   [  58% ] 800 VUs  0m35.0s/1m0s

running (0m35.1s), 800/800 VUs, 19944 complete and 0 interrupted iterations
default   [  60% ] 800 VUs  0m36.0s/1m0s

running (0m36.1s), 800/800 VUs, 20512 complete and 0 interrupted iterations
default   [  62% ] 800 VUs  0m37.0s/1m0s

running (0m37.1s), 800/800 VUs, 21106 complete and 0 interrupted iterations
default   [  63% ] 800 VUs  0m38.0s/1m0s

running (0m37.2s), 800/800 VUs, 21726 complete and 0 interrupted iterations
default   [  65% ] 800 VUs  0m39.0s/1m0s

running (0m38.2s), 800/800 VUs, 22274 complete and 0 interrupted iterations
default   [  67% ] 800 VUs  0m40.0s/1m0s

running (0m39.2s), 800/800 VUs, 22803 complete and 0 interrupted iterations
default   [  68% ] 800 VUs  0m41.0s/1m0s

running (0m40.2s), 800/800 VUs, 23352 complete and 0 interrupted iterations
default   [  70% ] 800 VUs  0m42.0s/1m0s

running (0m41.2s), 800/800 VUs, 23949 complete and 0 interrupted iterations
default   [  72% ] 800 VUs  0m43.0s/1m0s

running (0m42.2s), 800/800 VUs, 24566 complete and 0 interrupted iterations
default   [  73% ] 800 VUs  0m44.0s/1m0s

running (0m43.2s), 800/800 VUs, 25076 complete and 0 interrupted iterations
default   [  75% ] 800 VUs  0m45.0s/1m0s

running (0m44.2s), 800/800 VUs, 25633 complete and 0 interrupted iterations
default   [  77% ] 800 VUs  0m46.0s/1m0s

running (0m45.2s), 800/800 VUs, 26265 complete and 0 interrupted iterations
default   [  78% ] 800 VUs  0m47.0s/1m0s

running (0m46.2s), 800/800 VUs, 26791 complete and 0 interrupted iterations
default   [  80% ] 800 VUs  0m48.0s/1m0s

running (0m47.2s), 800/800 VUs, 27336 complete and 0 interrupted iterations
default   [  82% ] 800 VUs  0m49.0s/1m0s

running (0m48.2s), 800/800 VUs, 27962 complete and 0 interrupted iterations
default   [  83% ] 800 VUs  0m50.0s/1m0s

running (0m49.2s), 800/800 VUs, 28463 complete and 0 interrupted iterations
default   [  85% ] 800 VUs  0m51.0s/1m0s

running (0m50.2s), 800/800 VUs, 29022 complete and 0 interrupted iterations
default   [  87% ] 800 VUs  0m52.0s/1m0s

running (0m51.2s), 800/800 VUs, 29657 complete and 0 interrupted iterations
default   [  88% ] 800 VUs  0m53.0s/1m0s

running (0m52.2s), 800/800 VUs, 30142 complete and 0 interrupted iterations
default   [  90% ] 800 VUs  0m54.0s/1m0s

running (0m53.2s), 800/800 VUs, 30751 complete and 0 interrupted iterations
default   [  92% ] 800 VUs  0m55.0s/1m0s

running (0m54.2s), 800/800 VUs, 31324 complete and 0 interrupted iterations
default   [  93% ] 800 VUs  0m56.0s/1m0s

running (0m55.2s), 800/800 VUs, 31836 complete and 0 interrupted iterations
default   [  95% ] 800 VUs  0m57.0s/1m0s

running (0m56.2s), 800/800 VUs, 32432 complete and 0 interrupted iterations
default   [  97% ] 800 VUs  0m58.0s/1m0s

running (0m57.2s), 800/800 VUs, 32937 complete and 0 interrupted iterations
default   [  98% ] 800 VUs  0m59.0s/1m0s

running (0m58.2s), 800/800 VUs, 33573 complete and 0 interrupted iterations
default   [ 100% ] 800 VUs  1m00.0s/1m0s

running (0m59.2s), 000/800 VUs, 34396 complete and 0 interrupted iterations
default ✓ [ 100% ] 800 VUs  1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 52.01% 17890 out of 34396
    benchmark_total_failure_rate...: 52.01% 17890 out of 34396

    HTTP
    http_req_duration..............: avg=1.36s min=70.31µs  med=1.01s max=58.28s p(90)=1.26s p(95)=1.3s
      { expected_response:true }...: avg=1.25s min=70.31µs  med=1.01s max=58.25s p(90)=1.26s p(95)=1.3s
    http_req_failed................: 0.18%  64 out of 34396
    http_reqs......................: 34396  580.802307/s

    EXECUTION
    iteration_duration.............: avg=1.4s  min=418.49ms med=1.03s max=1m0s   p(90)=1.26s p(95)=1.3s
    iterations.....................: 34396  580.802307/s
    vus............................: 800    min=800            max=800
    vus_max........................: 800    min=800            max=800

    NETWORK
    data_received..................: 8.5 MB 144 kB/s
    data_sent......................: 1.1 GB 19 MB/s



running (0m59.2s), 000/800 VUs, 34396 complete and 0 interrupted iterations
default ✓ [ 100% ] 800 VUs  1m0s